---
kind: type
id: T:Autodesk.Revit.UI.RibbonItemData
source: html/eb399d25-88cb-c3a1-c445-37077b3a5aa1.htm
---
# Autodesk.Revit.UI.RibbonItemData

Base class used to contain information necessary to construct a RibbonItem in the Ribbon.

## Syntax (C#)
```csharp
public class RibbonItemData
```